Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128S1.atdf
          <instance name="FLEXCOM7">
            <register-group address-space="base" name="FLEXCOM7" name-in-module="FLEXCOM" offset="0x4001C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="16"/>
              <param name="CLOCK_ID" value="16"/>
              <param name="USART_FIFO_SIZE" value="8"/>
              <param name="SPI_FIFO_SIZE" value="8"/>
              <param name="TWI_FIFO_SIZE" value="8"/>
            </parameters>
            <signals>
              <signal pad="PB4" function="B" group="FLEXCOM7_IO" index="0"/>
              <signal pad="PC13" function="B" group="FLEXCOM7_IO" index="0"/>
              <signal pad="PC21" function="A" group="FLEXCOM7_IO" index="0"/>
              <signal pad="PB3" function="B" group="FLEXCOM7_IO" index="1"/>
              <signal pad="PC12" function="B" group="FLEXCOM7_IO" index="1"/>
              <signal pad="PC20" function="A" group="FLEXCOM7_IO" index="1"/>
              <signal pad="PB2" function="B" group="FLEXCOM7_IO" index="2"/>
              <signal pad="PC15" function="B" group="FLEXCOM7_IO" index="2"/>
              <signal pad="PB1" function="B" group="FLEXCOM7_IO" index="3"/>
              <signal pad="PC14" function="B" group="FLEXCOM7_IO" index="3"/>
              <signal pad="PB2" function="C" group="FLEXCOM7_IO" index="4"/>
              <signal pad="PC11" function="B" group="FLEXCOM7_IO" index="4"/>
            </signals>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="R">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x40053060"/>
          </instance>
        </module>
        <module name="IPC" id="11204" version="D">
          <instance name="IPC0">
            <register-group address-space="base" name="IPC0" name-in-module="IPC" offset="0x4002C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="28"/>
              <param name="CLOCK_ID" value="28"/>
            </parameters>
          </instance>
          <instance name="IPC1">
            <register-group address-space="base" name="IPC1" name-in-module="IPC" offset="0x48014000"/>
            <parameters>
              <param name="INSTANCE_ID" value="88"/>
              <param name="CLOCK_ID" value="88"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="6342" version="J">
          <instance name="MATRIX1">
            <register-group address-space="base" name="MATRIX1" name-in-module="MATRIX" offset="0x40044000"/>
            <parameters>
              <param name="INSTANCE_ID" value="61"/>
            </parameters>
          </instance>
          <instance name="MATRIX2">
            <register-group address-space="base" name="MATRIX2" name-in-module="MATRIX" offset="0x4A000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="94"/>
            </parameters>
          </instance>
          <instance name="MATRIX3">
            <register-group address-space="base" name="MATRIX3" name-in-module="MATRIX" offset="0x48020000"/>
            <parameters>
              <param name="INSTANCE_ID" value="95"/>
            </parameters>
          </instance>
        </module>
        <module name="MCSPI" id="04462" version="H">
          <instance name="MCSPI">
            <register-group address-space="base" name="MCSPI" name-in-module="MCSPI" offset="0x48018000"/>
            <parameters>
              <param name="INSTANCE_ID" value="89"/>
              <param name="CLOCK_ID" value="89"/>
            </parameters>
            <signals>
              <signal pad="PD6" function="A" group="MCSPI_MISO"/>
              <signal pad="PD22" function="A" group="MCSPI_MISO"/>
              <signal pad="PD7" function="A" group="MCSPI_MOSI" index="0"/>
              <signal pad="PD21" function="A" group="MCSPI_MOSI" index="0"/>
              <signal pad="PD8" function="B" group="MCSPI_MOSI" index="1"/>
              <signal pad="PD9" function="B" group="MCSPI_MOSI" index="2"/>
              <signal pad="PD10" function="B" group="MCSPI_MOSI" index="3"/>
              <signal pad="PD8" function="A" group="MCSPI_NPCS" index="0"/>
              <signal pad="PD23" function="A" group="MCSPI_NPCS" index="0"/>
              <signal pad="PD9" function="A" group="MCSPI_NPCS" index="1"/>
              <signal pad="PD10" function="A" group="MCSPI_NPCS" index="2"/>
              <signal pad="PD11" function="A" group="MCSPI_NPCS" index="3"/>
              <signal pad="PD5" function="A" group="MCSPI_SPCK"/>
              <signal pad="PD20" function="A" group="MCSPI_SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="MEM2MEM" id="11211" version="C">
          <instance name="MEM2MEM0">
            <register-group address-space="base" name="MEM2MEM0" name-in-module="MEM2MEM" offset="0x40034000"/>
            <parameters>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
            </parameters>
          </instance>
          <instance name="MEM2MEM1">
            <register-group address-space="base" name="MEM2MEM1" name-in-module="MEM2MEM" offset="0x48004000"/>
            <parameters>
              <param name="INSTANCE_ID" value="78"/>
              <param name="CLOCK_ID" value="78"/>
            </parameters>
          </instance>
        </module>
        <module name="PIO" id="11264" version="O">
          <instance name="PIO0">
            <register-group address-space="base" name="PIO0" name-in-module="PIO" offset="0x40048000"/>
            <parameters>
              <param name="CLOCK_ID" value="17"/>
            </parameters>
            <signals>
              <signal group="P" index="2" function="default" pad="PA2"/>
              <signal group="P" index="3" function="default" pad="PA3"/>
              <signal group="P" index="4" function="default" pad="PA4"/>
              <signal group="P" index="5" function="default" pad="PA5"/>
              <signal group="P" index="6" function="default" pad="PA6"/>
              <signal group="P" index="7" function="default" pad="PA7"/>
              <signal group="P" index="8" function="default" pad="PA8"/>
              <signal group="P" index="9" function="default" pad="PA9"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="26" function="default" pad="PA26"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="29" function="default" pad="PA29"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="32" function="default" pad="PB0"/>
              <signal group="P" index="33" function="default" pad="PB1"/>
              <signal group="P" index="34" function="default" pad="PB2"/>
              <signal group="P" index="35" function="default" pad="PB3"/>
              <signal group="P" index="36" function="default" pad="PB4"/>
              <signal group="P" index="37" function="default" pad="PB5"/>
              <signal group="P" index="38" function="default" pad="PB6"/>
              <signal group="P" index="39" function="default" pad="PB7"/>
              <signal group="P" index="40" function="default" pad="PB8"/>
              <signal group="P" index="41" function="default" pad="PB9"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="50" function="default" pad="PB18"/>
              <signal group="P" index="51" function="default" pad="PB19"/>
              <signal group="P" index="52" function="default" pad="PB20"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
              <signal group="P" index="56" function="default" pad="PB24"/>
              <signal group="P" index="57" function="default" pad="PB25"/>
              <signal group="P" index="58" function="default" pad="PB26"/>
              <signal group="P" index="64" function="default" pad="PC0"/>
              <signal group="P" index="65" function="default" pad="PC1"/>
              <signal group="P" index="66" function="default" pad="PC2"/>
              <signal group="P" index="67" function="default" pad="PC3"/>
              <signal group="P" index="69" function="default" pad="PC5"/>
              <signal group="P" index="70" function="default" pad="PC6"/>
              <signal group="P" index="71" function="default" pad="PC7"/>
              <signal group="P" index="72" function="default" pad="PC8"/>
              <signal group="P" index="73" function="default" pad="PC9"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="80" function="default" pad="PC16"/>
              <signal group="P" index="81" function="default" pad="PC17"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="86" function="default" pad="PC22"/>
            </signals>
          </instance>
          <instance name="PIOA">
            <parameters>
              <param name="INSTANCE_ID" value="17"/>
              <param name="INSTANCE_ID_SEC" value="18"/>
              <param name="PIO_BASE" value="PIO0"/>
              <param name="PIO_GROUP_INDEX" value="0"/>
            </parameters>
          </instance>
          <instance name="PIOB">
            <parameters>
              <param name="INSTANCE_ID" value="19"/>
              <param name="INSTANCE_ID_SEC" value="20"/>
              <param name="PIO_BASE" value="PIO0"/>
              <param name="PIO_GROUP_INDEX" value="1"/>
            </parameters>
          </instance>
