Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128S1.atdf
          <instance name="PIOC">
            <parameters>
              <param name="INSTANCE_ID" value="21"/>
              <param name="INSTANCE_ID_SEC" value="22"/>
              <param name="PIO_BASE" value="PIO0"/>
              <param name="PIO_GROUP_INDEX" value="2"/>
            </parameters>
          </instance>
          <instance name="PIO1">
            <register-group address-space="base" name="PIO1" name-in-module="PIO" offset="0x4800C000"/>
            <parameters>
              <param name="CLOCK_ID" value="85"/>
            </parameters>
            <signals>
              <signal group="P" index="96" function="default" pad="PD0"/>
              <signal group="P" index="97" function="default" pad="PD1"/>
              <signal group="P" index="98" function="default" pad="PD2"/>
              <signal group="P" index="99" function="default" pad="PD3"/>
              <signal group="P" index="108" function="default" pad="PD12"/>
              <signal group="P" index="109" function="default" pad="PD13"/>
              <signal group="P" index="112" function="default" pad="PD16"/>
              <signal group="P" index="113" function="default" pad="PD17"/>
              <signal group="P" index="114" function="default" pad="PD18"/>
              <signal group="P" index="115" function="default" pad="PD19"/>
            </signals>
          </instance>
          <instance name="PIOD">
            <parameters>
              <param name="INSTANCE_ID" value="85"/>
              <param name="INSTANCE_ID_SEC" value="86"/>
              <param name="PIO_BASE" value="PIO1"/>
              <param name="PIO_GROUP_INDEX" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="PMC" id="44171" version="I">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x46800000"/>
            <parameters>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
            <signals>
              <signal pad="PA20" function="A" group="PCK" index="0"/>
              <signal pad="PC22" function="A" group="PCK" index="0"/>
              <signal pad="PA2" function="A" group="PCK" index="1"/>
              <signal pad="PB1" function="C" group="PCK" index="1"/>
              <signal pad="PC5" function="A" group="PCK" index="2"/>
              <signal pad="PD4" function="B" group="PCK" index="2"/>
              <signal pad="PD29" function="A" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" id="6343" version="ZM">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x4801C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="90"/>
              <param name="CLOCK_ID" value="90"/>
              <param name="FAULT_PWM_ID0" value="0x0" caption="Fault 0 - PWM0_PWMFI0 Input pin"/>
              <param name="FAULT_PWM_ID1" value="0x1" caption="Fault 1 - PWM0_PWMFI1 Input pin"/>
              <param name="FAULT_PWM_ID2" value="0x2" caption="Fault 2 - Main Osc (PMC)"/>
              <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - ADC"/>
              <param name="FAULT_PWM_ID4" value="0x4" caption="Fault 4 - TC3"/>
              <param name="FAULT_PWM_ID5" value="0x5" caption="Fault 5 - TC0"/>
              <param name="FAULT_PWM_ID6" value="0x6" caption="Fault 6 - TC1"/>
              <param name="FAULT_PWM_ID7" value="0x7" caption="Fault 7 - TC2"/>
            </parameters>
            <signals>
              <signal pad="PD3" function="C" group="PWMH" index="0"/>
              <signal pad="PD15" function="B" group="PWMH" index="1"/>
              <signal pad="PD16" function="B" group="PWMH" index="2"/>
              <signal pad="PD17" function="A" group="PWML" index="0"/>
              <signal pad="PD18" function="A" group="PWML" index="1"/>
              <signal pad="PD19" function="A" group="PWML" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="QSPI" id="44132" version="G">
          <instance name="QSPI">
            <register-group address-space="base" name="QSPI" name-in-module="QSPI" offset="0x40020000"/>
            <parameters>
              <param name="INSTANCE_ID" value="23"/>
              <param name="CLOCK_ID" value="23"/>
            </parameters>
            <signals>
              <signal pad="PC14" function="A" group="QCS"/>
              <signal pad="PC13" function="A" group="QIO" index="0"/>
              <signal pad="PC12" function="A" group="QIO" index="1"/>
              <signal pad="PC11" function="A" group="QIO" index="2"/>
              <signal pad="PC10" function="A" group="QIO" index="3"/>
              <signal pad="PC15" function="A" group="QSCK"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" id="04678" version="G">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x40053000"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="04575" version="G">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x40053100"/>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="RTT" id="6081" version="Q">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x40053020"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SFR" id="04478" version="D">
          <instance name="SFR">
            <register-group address-space="base" name="SFR" name-in-module="SFR" offset="0x40050400"/>
