Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128S1.atdf
        <register caption="FLEXCOM Receive Holding Register" name="FLEX_RHR" offset="0x010" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RXDATA"/>
        </register>
        <register caption="FLEXCOM Transmit Holding Register" name="FLEX_THR" offset="0x020" rw="RW" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TXDATA"/>
        </register>
        <register caption="Receive Pointer Register" name="FLEX_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="FLEX_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="FLEX_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="FLEX_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="FLEX_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="FLEX_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="FLEX_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="FLEX_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="FLEX_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="FLEX_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="FLEX_PWPMR" offset="0x128" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="FLEX_PWPMR__WPKEY"/>
        </register>
        <register caption="USART Control Register" name="FLEX_US_CR" offset="0x200" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield caption="Clear TIMEOUT Flag and Start Timeout After Next Character Received" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield caption="Reset Iterations" mask="0x00002000" name="RSTIT"/>
          <bitfield caption="Reset Non Acknowledge" mask="0x00004000" name="RSTNACK"/>
          <bitfield caption="Start Timeout Immediately" mask="0x00008000" name="RETTO"/>
          <bitfield caption="Request to Send Enable" mask="0x00040000" name="RTSEN"/>
          <bitfield caption="Request to Send Disable" mask="0x00080000" name="RTSDIS"/>
          <bitfield caption="Abort LIN Transmission" mask="0x00100000" name="LINABT"/>
          <bitfield caption="Send LIN Wakeup Signal" mask="0x00200000" name="LINWKUP"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x01000000" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x02000000" name="RXFCLR"/>
          <bitfield caption="Transmit FIFO Lock CLEAR" mask="0x04000000" name="TXFLCLR"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x10000000" name="REQCLR"/>
          <bitfield caption="FIFO Enable" mask="0x40000000" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x80000000" name="FIFODIS"/>
        </register>
