Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128S1.atdf
      <value-group caption="Receiver Ready Mode" name="FLEX_TWI_FMR__RXRDYM">
        <value caption="RXRDY will be at level '1' when at least one unread data is in the receive FIFO. When DMA is enabled to transfer data the chunk of 1 byte must be configured in the DMA. If the transfer is performed by software, the access type (byte, halfword) must be defined accordingly." name="ONE_DATA" value="0x0"/>
        <value caption="RXRDY will be at level '1' when at least two unread data are in the receive FIFO. To minimize system bus load, when DMA is enabled to transfer data, the chunk of 1 halfword (1 halfword carries 2 bytes) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 2 accesses) or halfword (2 bytes per access, 1 single access)." name="TWO_DATA" value="0x1"/>
        <value caption="RXRDY will be at level '1' when at least four unread data are in the receive FIFO. To minimize system bus load, when DMA is enabled to transfer data, the chunk of 1 word (1 word carries 4 bytes) must be configured in the DMA. If the transfer is performed by software, the access type can be defined as byte (1 byte per access, 4 accesses), halfword (2 bytes per access, 2 accesses) or word (4 bytes per access, 1 single access)." name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="FLEX_TWI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN. Always reads as 0" name="PASSWD" value="0x545749"/>
      </value-group>
    </module>
    <module caption="General Purpose Backup Registers" name="GPBR" id="6378" version="R">
      <register-group name="GPBR">
        <register caption="GPBR Mode Register" name="GPBR_MR" offset="0x0" rw="RW" size="4">
          <bitfield caption="GPBRx Write Protection" mask="0x00000001" name="GPBRWP0"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000002" name="GPBRWP1"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000004" name="GPBRWP2"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000008" name="GPBRWP3"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000010" name="GPBRWP4"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000020" name="GPBRWP5"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000040" name="GPBRWP6"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000080" name="GPBRWP7"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000100" name="GPBRWP8"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000200" name="GPBRWP9"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000400" name="GPBRWP10"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00000800" name="GPBRWP11"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00001000" name="GPBRWP12"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00002000" name="GPBRWP13"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00004000" name="GPBRWP14"/>
          <bitfield caption="GPBRx Write Protection" mask="0x00008000" name="GPBRWP15"/>
          <bitfield caption="GPBRx Read Protection" mask="0x00010000" name="GPBRRP0"/>
          <bitfield caption="GPBRx Read Protection" mask="0x00020000" name="GPBRRP1"/>
          <bitfield caption="GPBRx Read Protection" mask="0x00040000" name="GPBRRP2"/>
          <bitfield caption="GPBRx Read Protection" mask="0x00080000" name="GPBRRP3"/>
          <bitfield caption="GPBRx Read Protection" mask="0x00100000" name="GPBRRP4"/>
          <bitfield caption="GPBRx Read Protection" mask="0x00200000" name="GPBRRP5"/>
          <bitfield caption="GPBRx Read Protection" mask="0x00400000" name="GPBRRP6"/>
          <bitfield caption="GPBRx Read Protection" mask="0x00800000" name="GPBRRP7"/>
          <bitfield caption="GPBRx Read Protection" mask="0x01000000" name="GPBRRP8"/>
          <bitfield caption="GPBRx Read Protection" mask="0x02000000" name="GPBRRP9"/>
          <bitfield caption="GPBRx Read Protection" mask="0x04000000" name="GPBRRP10"/>
          <bitfield caption="GPBRx Read Protection" mask="0x08000000" name="GPBRRP11"/>
          <bitfield caption="GPBRx Read Protection" mask="0x10000000" name="GPBRRP12"/>
          <bitfield caption="GPBRx Read Protection" mask="0x20000000" name="GPBRRP13"/>
          <bitfield caption="GPBRx Read Protection" mask="0x40000000" name="GPBRRP14"/>
          <bitfield caption="GPBRx Read Protection" mask="0x80000000" name="GPBRRP15"/>
        </register>
        <register caption="General Purpose Backup Register" name="SYS_GPBR" offset="0x8" rw="RW" size="4" count="24">
          <bitfield caption="Value of SYS_GPBRx" mask="0xFFFFFFFF" name="GPBR_VALUE"/>
        </register>
      </register-group>
    </module>
    <module caption="Inter-processor Communication" name="IPC" id="11204" version="D">
      <register-group name="IPC">
        <register caption="Interrupt Set Command Register" name="IPC_ISCR" offset="0x000" rw="W" size="4">
          <bitfield caption="Interrupt Set" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Set" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Set" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Set" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Set" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Set" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Set" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Set" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Set" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Set" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Set" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Set" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Set" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Set" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Set" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Set" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Set" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Set" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Set" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Set" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Set" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Set" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Set" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Set" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Set" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Set" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Set" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Set" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Set" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Set" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Set" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Set" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Clear Command Register" name="IPC_ICCR" offset="0x004" rw="W" size="4">
          <bitfield caption="Interrupt Clear" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Clear" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Clear" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Clear" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Clear" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Clear" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Clear" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Clear" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Clear" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Clear" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Clear" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Clear" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Clear" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Clear" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Clear" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Clear" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Clear" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Clear" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Clear" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Clear" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Clear" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Clear" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Clear" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Clear" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Clear" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Clear" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Clear" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Clear" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Clear" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Clear" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Clear" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Clear" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Pending Register" name="IPC_IPR" offset="0x008" rw="R" size="4">
          <bitfield caption="Interrupt Pending" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Pending" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Pending" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Pending" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Pending" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Pending" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Pending" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Pending" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Pending" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Pending" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Pending" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Pending" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Pending" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Pending" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Pending" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Pending" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Pending" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Pending" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Pending" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Pending" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Pending" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Pending" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Pending" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Pending" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Pending" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Pending" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Pending" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Pending" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Pending" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Pending" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Pending" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Pending" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Enable Command Register" name="IPC_IECR" offset="0x00C" rw="W" size="4">
          <bitfield caption="Interrupt Enable" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Enable" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Enable" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Enable" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Enable" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Enable" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Enable" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Enable" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Enable" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Enable" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Enable" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Enable" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Enable" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Enable" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Enable" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Enable" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Enable" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Enable" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Enable" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Enable" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Enable" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Enable" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Enable" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Enable" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Enable" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Enable" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Enable" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Enable" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Enable" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Enable" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Enable" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Enable" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Disable Command Register" name="IPC_IDCR" offset="0x010" rw="W" size="4">
          <bitfield caption="Interrupt Disable" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Disable" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Disable" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Disable" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Disable" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Disable" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Disable" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Disable" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Disable" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Disable" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Disable" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Disable" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Disable" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Disable" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Disable" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Disable" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Disable" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Disable" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Disable" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Disable" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Disable" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Disable" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Disable" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Disable" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Disable" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Disable" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Disable" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Disable" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Disable" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Disable" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Disable" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Disable" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Mask Register" name="IPC_IMR" offset="0x014" rw="R" size="4">
          <bitfield caption="Interrupt Mask" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Mask" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Mask" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Mask" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Mask" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Mask" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Mask" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Mask" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Mask" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Mask" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Mask" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Mask" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Mask" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Mask" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Mask" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Mask" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Mask" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Mask" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Mask" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Mask" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Mask" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Mask" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Mask" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Mask" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Mask" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Mask" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Mask" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Mask" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Mask" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Mask" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Mask" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Mask" mask="0x80000000" name="IRQ31"/>
        </register>
