Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128S1.atdf
      <value-group caption="I/O Line Function" name="PIO_P_CFGR0__FUNC">
        <value caption="Select the PIO mode for the selected I/O lines." name="GPIO" value="0x0"/>
        <value caption="Select the peripheral A for the selected I/O lines." name="PERIPH_A" value="0x1"/>
        <value caption="Select the peripheral B for the selected I/O lines." name="PERIPH_B" value="0x2"/>
        <value caption="Select the peripheral C for the selected I/O lines." name="PERIPH_C" value="0x3"/>
        <value caption="Select the peripheral D for the selected I/O lines." name="PERIPH_D" value="0x4"/>
      </value-group>
      <value-group caption="Direction" name="PIO_P_CFGR0__DIR">
        <value caption="The selected I/O lines are pure inputs." name="INPUT" value="0"/>
        <value caption="The selected I/O lines are enabled in output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="Pull-Up Enable" name="PIO_P_CFGR0__PUEN">
        <value caption="Pull-Up is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Up is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Pull-Down Enable" name="PIO_P_CFGR0__PDEN">
        <value caption="Pull-Down is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Down is enabled for the selected I/O lines only if PUEN is 0." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Input Filter Enable" name="PIO_P_CFGR0__IFEN">
        <value caption="The input filter is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="The input filter is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Open-Drain" name="PIO_P_CFGR0__OPD">
        <value caption="The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level." name="DISABLED" value="0"/>
        <value caption="The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Schmitt Trigger" name="PIO_P_CFGR0__SCHMITT">
        <value caption="Schmitt trigger is enabled for the selected I/O lines." name="ENABLED" value="0x0"/>
        <value caption="Schmitt trigger is disabled for the selected I/O lines." name="DISABLED" value="0x1"/>
      </value-group>
      <value-group caption="Slew Rate" name="PIO_P_CFGR0__SLEWRATE">
        <value caption="Slow slew rate" name="FAST" value="0x0"/>
        <value caption="Medium-fast slew rate" name="MEDIUMFAST" value="0x1"/>
        <value caption="Medium slew rate" name="MEDIUM" value="0x2"/>
        <value caption="Slow slew rate" name="SLOW" value="0x3"/>
      </value-group>
      <value-group caption="Event Selection" name="PIO_P_CFGR0__EVTSEL">
        <value caption="Event detection on input falling edge" name="FALLING" value="0x0"/>
        <value caption="Event detection on input rising edge" name="RISING" value="0x1"/>
        <value caption="Event detection on input both edge" name="BOTH" value="0x2"/>
        <value caption="Event detection on low level input" name="LOW" value="0x3"/>
        <value caption="Event detection on high level input" name="HIGH" value="0x4"/>
      </value-group>
      <value-group caption="Physical Configuration Freeze Status (read-only)" name="PIO_P_CFGR0__PCFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="Interrupt Configuration Freeze Status (read-only)" name="PIO_P_CFGR0__ICFS">
        <value caption="The fields are not frozen and can be written for this I/O line." name="NOT_FROZEN" value="0"/>
        <value caption="The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields." name="FROZEN" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P0">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P1">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P2">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P3">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P4">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P5">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P6">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P7">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
