Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128S1.atdf
        <register caption="Receive Pointer Register" name="QSPI_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="QSPI_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="QSPI_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="QSPI_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="QSPI_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="QSPI_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="QSPI_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="QSPI_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="QSPI_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="QSPI_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="QSPI_PWPMR" offset="0x128" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="QSPI_PWPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Serial Memory Mode" name="QSPI_MR__SMM">
        <value caption="The QSPI is in SPI mode." name="SPI" value="0"/>
        <value caption="The QSPI is in Serial Memory mode." name="MEMORY" value="1"/>
      </value-group>
      <value-group caption="Wait Data Read Before Transfer" name="QSPI_MR__WDRBT">
        <value caption="No effect. In SPI mode, a transfer can be initiated whatever the state of QSPI_RDR is." name="DISABLED" value="0"/>
        <value caption="In SPI mode, a transfer can start only if QSPI_RDR is empty, i.e., does not contain any unread data. This mode prevents overrun error in reception." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Chip Select Mode" name="QSPI_MR__CSMODE">
        <value caption="The chip select is deasserted if QSPI_TDR.TD has not been reloaded before the end of the current transfer." name="NOT_RELOADED" value="0x0"/>
        <value caption="The chip select is deasserted when the bit LASTXFER is written to '1' and the character written in QSPI_TDR.TD has been transferred." name="LASTXFER" value="0x1"/>
        <value caption="The chip select is deasserted systematically after each transfer." name="SYSTEMATICALLY" value="0x2"/>
      </value-group>
      <value-group caption="Number Of Bits Per Transfer" name="QSPI_MR__NBBITS">
        <value caption="8 bits for transfer" name="8_BIT" value="0x0"/>
        <value caption="16 bits for transfer" name="16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="Width of Instruction Code, Address, Option Code and Data" name="QSPI_IFR__WIDTH">
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI" name="SINGLE_BIT_SPI" value="0x0"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI" name="DUAL_OUTPUT" value="0x1"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI" name="QUAD_OUTPUT" value="0x2"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI" name="DUAL_IO" value="0x3"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI" name="QUAD_IO" value="0x4"/>
        <value caption="Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI" name="DUAL_CMD" value="0x5"/>
        <value caption="Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI" name="QUAD_CMD" value="0x6"/>
      </value-group>
      <value-group caption="Option Code Length" name="QSPI_IFR__OPTL">
        <value caption="The option code is 1 bit long." name="OPTION_1BIT" value="0x0"/>
        <value caption="The option code is 2 bits long." name="OPTION_2BIT" value="0x1"/>
        <value caption="The option code is 4 bits long." name="OPTION_4BIT" value="0x2"/>
        <value caption="The option code is 8 bits long." name="OPTION_8BIT" value="0x3"/>
      </value-group>
      <value-group caption="Address Length" name="QSPI_IFR__ADDRL">
        <value caption="8-bit address size" name="_8_BIT" value="0x0"/>
        <value caption="16-bit address size" name="_16_BIT" value="0x1"/>
        <value caption="24-bit address size" name="_24_BIT" value="0x2"/>
        <value caption="32-bit address size" name="_32_BIT" value="0x3"/>
      </value-group>
