Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128S1.atdf
        <register caption="Tamper Control Register" name="RTC_TCR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Timestamping on TMPx input is enabled" mask="0x00000001" name="TAMPEN0" values="RTC_TCR__TAMPEN0"/>
          <bitfield caption="Timestamping on TMPx input is enabled" mask="0x00000002" name="TAMPEN1" values="RTC_TCR__TAMPEN1"/>
          <bitfield caption="Timestamping on TMPx input is enabled" mask="0x00000004" name="TAMPEN2" values="RTC_TCR__TAMPEN2"/>
          <bitfield caption="Timestamping on TMPx input is enabled" mask="0x00000008" name="TAMPEN3" values="RTC_TCR__TAMPEN3"/>
          <bitfield caption="Timestamping on TMPx input is enabled" mask="0x00000010" name="TAMPEN4" values="RTC_TCR__TAMPEN4"/>
          <bitfield caption="Tamper Clear" mask="0x00010000" name="TAMPCLR" values="RTC_TCR__TAMPCLR"/>
          <bitfield caption="Full GPBR Clear" mask="0x00020000" name="FGPBRCLR" values="RTC_TCR__FGPBRCLR"/>
        </register>
        <register caption="Tamper Input Status Register" name="RTC_TISR" offset="0x38" rw="R" size="4">
          <bitfield caption="TMPx Input Status Register" mask="0x00000001" name="TISR0"/>
          <bitfield caption="TMPx Input Status Register" mask="0x00000002" name="TISR1"/>
          <bitfield caption="TMPx Input Status Register" mask="0x00000004" name="TISR2"/>
          <bitfield caption="TMPx Input Status Register" mask="0x00000008" name="TISR3"/>
          <bitfield caption="TMPx Input Status Register" mask="0x00000010" name="TISR4"/>
        </register>
        <register-group name="RTC_SUB0" size="16" name-in-module="RTC_SUB0" offset="0x40" count="5"/>
      </register-group>
      <value-group caption="Update Request Time Register" name="RTC_CR__UPDTIM">
        <value caption="No effect or, if UPDTIM has been previously written to 1, stops the update procedure." name="STOP_UPDATE" value="0"/>
        <value caption="Stops the RTC time counting. Second, minute and hour counters can be programmed once this bit is set and acknowledged by the bit ACKUPD of the RTC_SR." name="START_UPDATE" value="1"/>
      </value-group>
      <value-group caption="Update Request Calendar Register" name="RTC_CR__UPDCAL">
        <value caption="No effect or, if UPDCAL has been previously written to 1, stops the update procedure." name="STOP_UPDATE" value="0"/>
        <value caption="Stops the RTC calendar counting." name="START_UPDATE" value="1"/>
      </value-group>
      <value-group caption="Time Event Selection" name="RTC_CR__TIMEVSEL">
        <value caption="Minute change" name="MINUTE" value="0x0"/>
        <value caption="Hour change" name="HOUR" value="0x1"/>
        <value caption="Every day at midnight" name="MIDNIGHT" value="0x2"/>
        <value caption="Every day at noon" name="NOON" value="0x3"/>
      </value-group>
      <value-group caption="Calendar Event Selection" name="RTC_CR__CALEVSEL">
        <value caption="Week change (every Monday at time 00:00:00)" name="WEEK" value="0x0"/>
        <value caption="Month change (every 01 of each month at time 00:00:00)" name="MONTH" value="0x1"/>
        <value caption="Year change (every January 1 at time 00:00:00)" name="YEAR" value="0x2"/>
      </value-group>
      <value-group caption="12-/24-hour Mode" name="RTC_MR__HRMOD">
        <value caption="24-hour mode is selected." name="_24HOURS" value="0"/>
        <value caption="12-hour mode is selected." name="AMPM" value="1"/>
      </value-group>
      <value-group caption="PERSIAN Calendar" name="RTC_MR__PERSIAN">
        <value caption="Gregorian calendar." name="DISABLED" value="0"/>
        <value caption="Persian calendar." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="UTC Time Format" name="RTC_MR__UTC">
        <value caption="Gregorian or Persian calendar." name="DISABLED" value="0"/>
        <value caption="UTC format." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="NEGative PPM Correction" name="RTC_MR__NEGPPM">
        <value caption="Positive correction (the divider will be slightly higher than 32768)." name="DISABLED" value="0"/>
        <value caption="Negative correction (the divider will be slightly lower than 32768)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="HIGH PPM Correction" name="RTC_MR__HIGHPPM">
        <value caption="Lower range ppm correction with accurate correction (below 30ppm correction)." name="DISABLED" value="0"/>
        <value caption="Higher range ppm correction with accurate correction (higher than 30ppm correction)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="RTCOUT0 OutputSource Selection" name="RTC_MR__OUT0">
        <value caption="No waveform, stuck at '0'" name="NO_WAVE" value="0x0"/>
        <value caption="1 Hz square wave" name="FREQ1HZ" value="0x1"/>
        <value caption="32 Hz square wave" name="FREQ32HZ" value="0x2"/>
        <value caption="64 Hz square wave" name="FREQ64HZ" value="0x3"/>
        <value caption="512 Hz square wave" name="FREQ512HZ" value="0x4"/>
        <value caption="Output toggles when alarm flag rises" name="ALARM_TOGGLE" value="0x5"/>
        <value caption="Output is a copy of the alarm flag" name="ALARM_FLAG" value="0x6"/>
        <value caption="Duty cycle programmable pulse" name="PROG_PULSE" value="0x7"/>
      </value-group>
      <value-group caption="RTCOUT1 Output Source Selection" name="RTC_MR__OUT1">
        <value caption="No waveform, stuck at '0'" name="NO_WAVE" value="0x0"/>
        <value caption="1 Hz square wave" name="FREQ1HZ" value="0x1"/>
        <value caption="32 Hz square wave" name="FREQ32HZ" value="0x2"/>
        <value caption="64 Hz square wave" name="FREQ64HZ" value="0x3"/>
        <value caption="512 Hz square wave" name="FREQ512HZ" value="0x4"/>
        <value caption="Output toggles when alarm flag rises" name="ALARM_TOGGLE" value="0x5"/>
        <value caption="Output is a copy of the alarm flag" name="ALARM_FLAG" value="0x6"/>
        <value caption="Duty cycle programmable pulse" name="PROG_PULSE" value="0x7"/>
      </value-group>
