Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/atdf/PIC32CX2051MTSH128S1.atdf
      <value-group caption="VDD3V3 Supply Monitor Power Supply Mode" name="SUPC_SMMR__VDD3V3SMPWRM">
        <value caption="The VDDBU power source selection is controlled by configuring the bit RSTC_MR.PWRSW." name="MANUAL" value="0"/>
        <value caption="The VDDBU power source is VBAT when a VDD3V3 undervoltage is detected by the VDD3V3 supply monitor." name="AUTO_VDD3V3SM" value="1"/>
      </value-group>
      <value-group caption="LCD Controller Mode of Operation" name="SUPC_MR__LCDMODE">
        <value caption="The internal supply source and the external supply source are both deselected (OFF Mode)." name="LCDOFF" value="0x0"/>
        <value caption="The external supply source for LCD (VDDLCD) is selected (the embedded LCD voltage regulator is in High-impedance mode)." name="LCDON_EXTVR" value="0x2"/>
        <value caption="The internal voltage regulator for VDDLCD is selected (Active mode)." name="LCDON_INVR" value="0x3"/>
      </value-group>
      <value-group caption="VDDCORE Supply Monitor Output Mode" name="SUPC_MR__CORSMM">
        <value caption="VDDCORE supply monitor output value has no effect. Power-on is performed whatever the value of the supply monitor output." name="NO_EFFECT" value="0"/>
        <value caption="VDDCORE supply monitor output value is checked to validate the VDDCORE domain power-on." name="VALID_VDD" value="1"/>
      </value-group>
      <value-group caption="Internal VDDCORE Voltage Regulator Disable" name="SUPC_MR__VREGDIS">
        <value caption="Internal VDDCORE voltage regulator is enabled." name="INT_VREG" value="0"/>
        <value caption="Internal VDDCORE voltage regulator is disabled (external power supply is used)." name="EXT_VREG" value="1"/>
      </value-group>
      <value-group caption="Slow Crystal Oscillator Bypass" name="SUPC_MR__OSCBYPASS">
        <value caption="No effect. Clock selection depends on the value of the bit SUPC_CR.TDXTALSEL." name="NO_EFFECT" value="0"/>
        <value caption="The slow crystal oscillator is bypassed if SUPC_CR.TDXTALSEL=1. The bit OSCBYPASS must be set prior to setting the bit TDXTALSEL." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="Password Key" name="SUPC_MR__KEY">
        <value caption="Modifies the VREGDIS bit. Other bits are not affected." name="PASSWD1" value="0x59"/>
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="Force Wake-up Inputs Debouncer Period" name="SUPC_WUMR__FWUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="WKUPx shall be in its active state for at least 3 MD_SLCK periods" name="_3_SK" value="0x1"/>
        <value caption="WKUPx shall be in its active state for at least 32 MD_SLCK periods" name="_32_SK" value="0x2"/>
        <value caption="WKUPx shall be in its active state for at least 512 MD_SLCK periods" name="_512_SK" value="0x3"/>
        <value caption="WKUPx shall be in its active state for at least 4,096 MD_SLCK periods" name="_4096_SK" value="0x4"/>
        <value caption="WKUPx shall be in its active state for at least 32,768 MD_SLCK periods" name="_32768_SK" value="0x5"/>
      </value-group>
      <value-group caption="Wake-up Inputs Debouncer Period" name="SUPC_WUMR__WKUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="WKUPx shall be in its active state for at least 3 MD_SLCK periods" name="_3_SK" value="0x1"/>
        <value caption="WKUPx shall be in its active state for at least 32 MD_SLCK periods" name="_32_SK" value="0x2"/>
        <value caption="WKUPx shall be in its active state for at least 512 MD_SLCK periods" name="_512_SK" value="0x3"/>
        <value caption="WKUPx shall be in its active state for at least 4,096 MD_SLCK periods" name="_4096_SK" value="0x4"/>
        <value caption="WKUPx shall be in its active state for at least 32,768 MD_SLCK periods" name="_32768_SK" value="0x5"/>
      </value-group>
      <value-group caption="Low-power Debouncer Period of WKUPx" name="SUPC_WUMR__LPDBC0">
        <value caption="Disables the low-power debouncers." name="DISABLE" value="0x0"/>
        <value caption="WKUPx in active state for at least 2 RTCOUTx clock periods" name="_2_RTCOUT" value="0x1"/>
        <value caption="WKUPx in active state for at least 3 RTCOUTx clock periods" name="_3_RTCOUT" value="0x2"/>
        <value caption="WKUPx in active state for at least 4 RTCOUTx clock periods" name="_4_RTCOUT" value="0x3"/>
        <value caption="WKUPx in active state for at least 5 RTCOUTx clock periods" name="_5_RTCOUT" value="0x4"/>
        <value caption="WKUPx in active state for at least 6 RTCOUTx clock periods" name="_6_RTCOUT" value="0x5"/>
        <value caption="WKUPx in active state for at least 7 RTCOUTx clock periods" name="_7_RTCOUT" value="0x6"/>
        <value caption="WKUPx in active state for at least 8 RTCOUTx clock periods" name="_8_RTCOUT" value="0x7"/>
      </value-group>
      <value-group caption="Low-power Debouncer Period of WKUPx" name="SUPC_WUMR__LPDBC1">
        <value caption="Disables the low-power debouncers." name="DISABLE" value="0x0"/>
        <value caption="WKUPx in active state for at least 2 RTCOUTx clock periods" name="_2_RTCOUT" value="0x1"/>
        <value caption="WKUPx in active state for at least 3 RTCOUTx clock periods" name="_3_RTCOUT" value="0x2"/>
        <value caption="WKUPx in active state for at least 4 RTCOUTx clock periods" name="_4_RTCOUT" value="0x3"/>
        <value caption="WKUPx in active state for at least 5 RTCOUTx clock periods" name="_5_RTCOUT" value="0x4"/>
        <value caption="WKUPx in active state for at least 6 RTCOUTx clock periods" name="_6_RTCOUT" value="0x5"/>
        <value caption="WKUPx in active state for at least 7 RTCOUTx clock periods" name="_7_RTCOUT" value="0x6"/>
        <value caption="WKUPx in active state for at least 8 RTCOUTx clock periods" name="_8_RTCOUT" value="0x7"/>
      </value-group>
